hybridPorousFoam-tutorials/Example_Applications/Drainage_and_Imbibition/single_Phase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 0
);

regions
(
    boxToCell
    {
        box (0 0.0001 0) (3e-5 0.0007 1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1 
        );
    }
);


// ************************************************************************* //
